# ViewType Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ViewShapeBuilder..::..ViewType Property
ViewShapeBuilder Class See Also
---
View type where the view-specific shape currently being built will be used
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2015
# Syntax
C#
---
```text
public DirectShapeTargetViewType ViewType { get; set; }
```

Visual Basic
---
```text
Public Property ViewType As DirectShapeTargetViewType
	Get
	Set
```

Visual C++
---
```text
public:
property DirectShapeTargetViewType ViewType {
	DirectShapeTargetViewType get ();
	void set (DirectShapeTargetViewType value);
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | When setting this property: A value passed for an enumeration argument is not a member of that enumeration |

# See Also
ViewShapeBuilder Class
Autodesk.Revit.DB Namespace